class TestsData:

    faq_answers = {
        'Q1': 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.',
        'Q2': 'Пока что у нас так: один заказ — один самокат. '
              'Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.',
        'Q3': 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. '
              'Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. '
              'Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.',
        'Q4': 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.',
        'Q5': 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.',
        'Q6': 'Самокат приезжает к вам с полной зарядкой. '
              'Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.',
        'Q7': 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.',
        'Q8': 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
    }

    scooter_order_dataset_1 = {
        'name' : 'Антон',
        'surname': 'Лысаков',
        'address': 'ул. Пушкина д. Колотушкина',
        'phone_number': '+77777077172'
    }

    scooter_order_dataset_2 = {
        'name' : 'Иван',
        'surname': 'Петров',
        'address': 'Солнечная система, планета Марс',
        'phone_number': '+7777077152'
    }

    urls = {
        'order_page': 'https://qa-scooter.praktikum-services.ru/order',
        'home_page': 'https://qa-scooter.praktikum-services.ru/',
        'dzen_redirect': 'https://dzen.ru/?yredirect=true'
    }
